/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_pwd.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seokjyan <seokjyan@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/04 16:32:06 by seokjyan          #+#    #+#             */
/*   Updated: 2024/01/05 21:22:20 by seokjyan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../microshell.h"

void    ft_pwd(char **args)
{
    char    *path;
    path = getcwd(NULL, 0);
    ft_putstr_fd(path, 1);
}
//대체 이 이상 무엇이 필요하지...
